# XYZ Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ Constructor
XYZ Class See Also
---
Creates a default XYZ with the values (0, 0, 0).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
XYZ()
```

# See Also
XYZ Class
XYZ Overload
Autodesk.Revit.DB Namespace